# Advanced Dataframes Exercises Part 1

In [6]:
#imports needed for exercises
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

from pydataset import data

In [1]:
#obtain a connection
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [4]:
#test connection with query from exercises
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

### 3.  Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [9]:
def get_db_url(db, user=user, host=host, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'


### 4.  Use your function to obtain a connection to the employees database.

In [30]:
test_query = "SELECT * FROM employees LIMIT 5 OFFSET 75"  #create variable for test sql query

In [33]:
test_db = pd.read_sql(test_query, get_db_url('employees')) #create test db using function and test sql query

In [32]:
test_db.head #explore test db

<bound method NDFrame.head of    emp_no  birth_date first_name  last_name gender   hire_date
0   10076  1952-06-13       Erez   Ritzmann      F  1985-07-09
1   10077  1964-04-18       Mona      Azuma      M  1990-03-02
2   10078  1959-12-25      Danel  Mondadori      F  1987-05-26
3   10079  1961-10-05    Kshitij       Gils      F  1986-03-27
4   10080  1957-12-03     Premal       Baek      M  1985-11-19>

### 5.  Once you have successfully run a query:  
### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [22]:
sql_query_typo = "SELECT * FROM department" # create variable with typo- department is not a table

In [ ]:
departments_typo = pd.read_sql(sql_query_typo, get_db_url('departments'))  ##returns operational error

### b.  Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
pd.read_sql('SELECT % FROM employees LIMIT 5 OFFSET 50', url)  #added percent in place of * to create SQL synatx error
#returns type error

### 6. Read the employees and titles tables into two separate DataFrames.

In [26]:
sql_query = "SELECT * FROM employees" #create variable containing test sql query

In [20]:
employees = pd.read_sql(sql_query, get_db_url('employees'))  
#create df using function to test connection

In [21]:
employees.head()  #explore employees dataframe returned

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [34]:
titles_sql_query = "SELECT * FROM titles" #create sql query for titles db

In [36]:
titles = pd.read_sql(titles_sql_query, get_db_url('employees')) #create titles dataframe

In [37]:
titles.head() #explore titles df

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [43]:
#get shape of employees
employees.shape

(300024, 6)

In [44]:
titles.shape #get rows and columns of titles df

(443308, 4)

### 8. Display the summary statistics for each DataFrame.

In [45]:
employees.info

<bound method DataFrame.info of         emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]>

In [46]:
employees.describe

<bound method NDFrame.describe of         emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]>

In [47]:
titles.info

<bound method DataFrame.info of         emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]>

In [48]:
titles.describe

<bound method NDFrame.describe of         emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]>

### 9. How many unique titles are in the titles DataFrame?

In [50]:
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [49]:
len(titles.title.value_counts())  # use len to count number

7

### 10. What is the oldest date in the to_date column?

In [52]:
titles.to_date.sort_values().head(1)

16064    1985-03-01
Name: to_date, dtype: object

### 9. What is the most recent date in the to_date column?

In [53]:
titles.to_date.sort_values().tail(1)

443307    9999-01-01
Name: to_date, dtype: object

# Exercises Part 2

### 1.  Copy the users and roles DataFrames from the examples above.

In [54]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [55]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

## 2. What is the result of using a right join on the DataFrames?

#### The values that are left_only are missing from the dataframe because it is a left join.  Jane and Mike are not listed in the dataframe for this reason.

In [62]:
join_right = users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

join_right

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

### 3.  What is the result of using an outer join on the DataFrames?

#### The outer join results in displaying the rows from both table.

In [63]:
outer_join = users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)
outer_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

### 4.  What happens if you drop the foreign keys from the DataFrames and try to merge them?

### the table's data is now compromised.

In [64]:
users.drop(columns="role_id").merge(roles, how="outer", on="id")

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter
4   5   jane        NaN
5   6   mike        NaN

### 5.  Load the mpg dataset from PyDataset.

In [68]:
from pydataset import data

mpg = data('mpg')
mpg.head

<bound method NDFrame.head of     manufacturer   model  displ  year  cyl       trans drv  cty  hwy fl  \
1           audi      a4    1.8  1999    4    auto(l5)   f   18   29  p
2           audi      a4    1.8  1999    4  manual(m5)   f   21   29  p
3           audi      a4    2.0  2008    4  manual(m6)   f   20   31  p
4           audi      a4    2.0  2008    4    auto(av)   f   21   30  p
5           audi      a4    2.8  1999    6    auto(l5)   f   16   26  p
..           ...     ...    ...   ...  ...         ...  ..  ...  ... ..
230   volkswagen  passat    2.0  2008    4    auto(s6)   f   19   28  p
231   volkswagen  passat    2.0  2008    4  manual(m6)   f   21   29  p
232   volkswagen  passat    2.8  1999    6    auto(l5)   f   16   26  p
233   volkswagen  passat    2.8  1999    6  manual(m5)   f   18   26  p
234   volkswagen  passat    3.6  2008    6    auto(s6)   f   17   26  p

       class
1    compact
2    compact
3    compact
4    compact
5    compact
..       ...
230  midsize
231  midsize
232  midsize
233  midsize
234  midsize

[234 rows x 11 columns]>

### 6. Output and read the documentation for the mpg dataset

In [69]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

###  7.How many rows and columns are in the dataset?

In [73]:
mpg.shape
print(f'the numbers of rows is' {rows})

SyntaxError: invalid syntax (<ipython-input-73-7e38aaa078c3>, line 2)